package com.gumio_inf.aacsampleapp.model.vo

import com.gumio_inf.aacsampleapp.R

class Ramens {

    companion object {
        private val RAMEN_DRAWABLES = intArrayOf(
                R.drawable.ramen_1, R.drawable.ramen_2,
                R.drawable.ramen_3, R.drawable.ramen_4
        )

        fun getDrawableForRamen(ramen: String): Int {
            return RAMEN_DRAWABLES[ramen.length % RAMEN_DRAWABLES.size]
        }

        val RAMENS = arrayOf(
                "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家",
                "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家",
                "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家",
                "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋",
                "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家",
                "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家",
                "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋",
                "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家",
                "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋",
                "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家",
                "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家",
                "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋",
                "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋",
                "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋",
                "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家",
                "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家",
                "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家",
                "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家",
                "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋",
                "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋",
                "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋",
                "おざき家", "まこと家",
                "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋",
                "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏",
                "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家", "まこと家", "極鶏", "ずんどう屋", "おざき家",
                "まこと家", "極鶏", "ずんどう屋"
        )
    }
}